# TextBoxEnterPressedEventArgs Properties

---
The TextBoxEnterPressedEventArgs type exposes the following members.
| Name| Description
---|---|---
| Application|  The current UIApplication. (Inherited from RibbonItemEventArgs)
Top
#### Reference
TextBoxEnterPressedEventArgs Class
Autodesk.Revit.UI.Events Namespace